In [4]:
library(tidyverse)

In [28]:
d.class<-read_csv('data/class.csv')
d.class

Rows: 19 Columns: 5

── Column specification ────────────────────────────────────────────────────────
Delimiter: ","
chr (2): name, sex
dbl (3): age, height, weight

ℹ Use `spec()` to retrieve the full column specification for this data.
ℹ Specify the column types or set `show_col_types = FALSE` to quiet this message.

   name    sex age height weight
1  Alice   F   13  56.5    84.0
2  Becka   F   13  65.3    98.0
3  Gail    F   14  64.3    90.0
4  Karen   F   12  56.3    77.0
5  Kathy   F   12  59.8    84.5
6  Mary    F   15  66.5   112.0
7  Sandy   F   11  51.3    50.5
8  Sharon  F   15  62.5   112.5
9  Tammy   F   14  62.8   102.5
10 Alfred  M   14  69.0   112.5
11 Duke    M   14  63.5   102.5
12 Guido   M   15  67.0   133.0
13 James   M   12  57.3    83.0
14 Jeffrey M   13  62.5    84.0
15 John    M   12  59.0    99.5
16 Philip  M   16  72.0   150.0
17 Robert  M   12  64.8   128.0
18 Thomas  M   11  57.5    85.0
19 William M   15  66.5   112.0

In [5]:
d.sep <- read_csv(
"testid, succ/total
1, 1/10
2, 3/5
3, 2/8
")

Rows: 3 Columns: 2
── Column specification ────────────────────────────────────────────────────────
Delimiter: ","
chr (1): succ/total
dbl (1): testid

ℹ Use `spec()` to retrieve the full column specification for this data.
ℹ Specify the column types or set `show_col_types = FALSE` to quiet this message.

In [8]:
d.sep %>% separate(`succ/total`, c("succ", "total"), sep = "/", convert = TRUE)
d.sep

  testid succ total
1 1      1    10
2 2      3     5
3 3      2     8

  testid succ/total
1 1      1/10
2 2      3/5
3 3      2/8

In [11]:
dbpa<-read_csv("var,avg
male:systolicbp,118
male:diastolicbp,85
female:systolicbp,115
female:diastolicbp,83")
dbpa

Rows: 4 Columns: 2
── Column specification ────────────────────────────────────────────────────────
Delimiter: ","
chr (1): var
dbl (1): avg

ℹ Use `spec()` to retrieve the full column specification for this data.
ℹ Specify the column types or set `show_col_types = FALSE` to quiet this message.

  var                avg
1 male:systolicbp    118
2 male:diastolicbp    85
3 female:systolicbp  115
4 female:diastolicbp  83

In [16]:
dbpa2 <-dbpa %>% separate(var,into = c('sex','var'),sep=':')
dbpa2
dbpa2 %>% pivot_wider(names_from = var,values_from = avg)

  sex    var         avg
1 male   systolicbp  118
2 male   diastolicbp  85
3 female systolicbp  115
4 female diastolicbp  83

  sex    systolicbp diastolicbp
1 male   118        85
2 female 115        83

In [19]:
## extract()函数使用
dexp <- tibble(
  design = c("AA", "AB", "BA", "BB"),
  response = c(120, 110, 105, 95))
dexp

  design response
1 AA     120
2 AB     110
3 BA     105
4 BB      95

In [25]:
dexp %>% extract(design,into=c('fac1','fac2'),regex = '(.)(.)')
dexp %>% separate(design,into=c('fac1','fac2'),sep = 1)

  fac1 fac2 response
1 A    A    120
2 A    B    110
3 B    A    105
4 B    B     95

  fac1 fac2 response
1 A    A    120
2 A    B    110
3 B    A    105
4 B    B     95

In [33]:
#数据框纵向合并bind_rows()
d3.class<-d.class %>% select(name,sex,age) %>% filter(sex=='M')
d4.class<-d.class %>% select(name,sex,age) %>% filter(sex=='F')
d3.class
d4.class

   name    sex age
1  Alfred  M   14
2  Duke    M   14
3  Guido   M   15
4  James   M   12
5  Jeffrey M   13
6  John    M   12
7  Philip  M   16
8  Robert  M   12
9  Thomas  M   11
10 William M   15

  name   sex age
1 Alice  F   13
2 Becka  F   13
3 Gail   F   14
4 Karen  F   12
5 Kathy  F   12
6 Mary   F   15
7 Sandy  F   11
8 Sharon F   15
9 Tammy  F   14

In [39]:
d.class %>% arrange(desc(sex),desc(age)) %>% select(name,sex,age)

   name    sex age
1  Philip  M   16
2  Guido   M   15
3  William M   15
4  Alfred  M   14
5  Duke    M   14
6  Jeffrey M   13
7  James   M   12
8  John    M   12
9  Robert  M   12
10 Thomas  M   11
11 Mary    F   15
12 Sharon  F   15
13 Gail    F   14
14 Tammy   F   14
15 Alice   F   13
16 Becka   F   13
17 Karen   F   12
18 Kathy   F   12
19 Sandy   F   11

In [34]:
d3.class %>% bind_rows(d4.class)
d3.class

   name    sex age
1  Alfred  M   14
2  Duke    M   14
3  Guido   M   15
4  James   M   12
5  Jeffrey M   13
6  John    M   12
7  Philip  M   16
8  Robert  M   12
9  Thomas  M   11
10 William M   15
11 Alice   F   13
12 Becka   F   13
13 Gail    F   14
14 Karen   F   12
15 Kathy   F   12
16 Mary    F   15
17 Sandy   F   11
18 Sharon  F   15
19 Tammy   F   14

   name    sex age
1  Alfred  M   14
2  Duke    M   14
3  Guido   M   15
4  James   M   12
5  Jeffrey M   13
6  John    M   12
7  Philip  M   16
8  Robert  M   12
9  Thomas  M   11
10 William M   15

In [41]:
d3.class |>
  select(age, name, sex) |>
  bind_rows(d4.class)

   age name    sex
1  14  Alfred  M
2  14  Duke    M
3  15  Guido   M
4  12  James   M
5  13  Jeffrey M
6  12  John    M
7  16  Philip  M
8  12  Robert  M
9  11  Thomas  M
10 15  William M
11 13  Alice   F
12 13  Becka   F
13 14  Gail    F
14 12  Karen   F
15 12  Kathy   F
16 15  Mary    F
17 11  Sandy   F
18 15  Sharon  F
19 14  Tammy   F

In [43]:
#横向合并
d.class |>
  count(name) |>
  filter(n>1) |>
  nrow()
#没有发现重复出现的name，说明d.class中的name可以作为主键

[1] 0

In [45]:
d1.class <- d.class |>
  filter(age <= 12) |>
  select(name, sex) |>
  filter(!(name %in%  "Sandy"))
d2.class <- d.class |>
  filter(age <= 12) |>
  select(name, age, height, weight)
d1.class
d2.class

  name   sex
1 Karen  F
2 Kathy  F
3 James  M
4 John   M
5 Robert M
6 Thomas M

  name   age height weight
1 Karen  12  56.3    77.0
2 Kathy  12  59.8    84.5
3 Sandy  11  51.3    50.5
4 James  12  57.3    83.0
5 John   12  59.0    99.5
6 Robert 12  64.8   128.0
7 Thomas 11  57.5    85.0

In [49]:
d1.class |>
  inner_join(d2.class,by = 'name',unmatched = 'drop')

  name   sex age height weight
1 Karen  F   12  56.3    77.0
2 Kathy  F   12  59.8    84.5
3 James  M   12  57.3    83.0
4 John   M   12  59.0    99.5
5 Robert M   12  64.8   128.0
6 Thomas M   11  57.5    85.0

In [56]:
d.stu <- tibble(
  sid=c(1,2,3,4,5,6),
  cid=c(1,2,1,2,1,2),
  sname=c("John", "Mary", "James", "Kitty", "Jasmine", "Kim"),
  sex=c("M", "F", "M", "F", "F", "M"))

  d.cl <- tibble(
  cid=c(1,2,3),
  tname=c("Philip", "Joane",'aaa'),
  grade=c("2017", "2016",'2035')
)

In [57]:
d.stu |>
  full_join(d.cl, join_by(cid))

  sid cid sname   sex tname  grade
1  1  1   John    M   Philip 2017
2  2  2   Mary    F   Joane  2016
3  3  1   James   M   Philip 2017
4  4  2   Kitty   F   Joane  2016
5  5  1   Jasmine F   Philip 2017
6  6  2   Kim     M   Joane  2016
7 NA  3   NA      NA  aaa    2035

In [58]:
d.class |> 
  select(height, weight) |>
  scale()

      height      weight
 [1,] -1.13843504 -0.70371312
 [2,]  0.57794313 -0.08897522
 [3,]  0.38290015 -0.44025402
 [4,] -1.17744363 -1.01108207
 [5,] -0.49479323 -0.68175819
 [6,]  0.81199469  0.52576268
 [7,] -2.15265850 -2.17469309
 [8,]  0.03182280  0.54771760
 [9,]  0.09033569  0.10861910
[10,]  1.29960213  0.54771760
[11,]  0.22686577  0.10861910
[12,]  0.90951618  1.44786952
[13,] -0.98240066 -0.74762297
[14,]  0.03182280 -0.70371312
[15,] -0.65082761 -0.02311045
[16,]  1.88473105  2.19433697
[17,]  0.48042164  1.22832027
[18,] -0.94339207 -0.65980327
[19,]  0.81199469  0.52576268